# Создать список произвольного содержания.
# Вывести на экран третий, пятый и шестой элементы
my_list = [15, 5, 466, 3198, 52, 5, 44, 4]
print(my_list[2], my_list[4], my_list[5])

