# Создать множество произвольного содержания.
# После каждой операции выводить множество на экран
my_set = {1, 3, 5}
# Добавить 34 во множество.
my_set.add(34)
print(my_set)
# Удалить 34 из множества
my_set.remove(34)
print(my_set)