# Дана длина ребра куба.
# Найти объем куба и площадь всей его поверхности.
a = int(input('Введите число a: '))
print(a ** 3)
print((a ** 2) * 6)
