# Создать три переменные, содержащие возраст трех человек, найти сумму и вывести ее на экран.
# Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран
a = 12
b = 36
c = 40
d = (a + b + c) / 3
print((a + c + b), d)