# Даны два числа.
# Найти среднее арифметическое и среднее геометрическое этих чисел
from math import sqrt
x = int(input('Введите число x: '))
y = int(input('Введите число y: '))
print((x + y) / 2)
print(sqrt(x * y))
