# Определить переменные всех 4 базовых типов и вывести их на экран
my_int = 12
print(my_int)
my_float = 12.4
print(my_float)
my_str = "sdsadsaf34534r"
print(my_str)
my_bool = True
print(my_bool)