# Даны 2 действительных числа a и b.
# Получить их сумму, разность и произведение.
a = float(input('Введите число a: '))
b = float(input('Введите число b: '))
print(a + b)
print(a - b)
print(a * b)


