# Даны действительные числа x и y. Получить
# Для нахождения модуля использовать функцию abs(..)
x = float(input('Введите число x: '))
y = float(input('Введите число y: '))
print((abs(x) - abs(y)) / (1 + abs(x + y)))