# Пользователь вводит три числа.
a = int(input('Введите число a: '))
b = int(input('Введите число b: '))
c  = int(input('Введите число c: '))
# Увеличьте первое число в два раза,
a = a * 2
print(a)
# второе числа уменьшите на 3,
b = b - 3
print(b)
# третье число возведите в квадрат и затем найдите сумму новых трех чисел.
c = c ** 2
print(c)
print(a + b + c)
