# Ввести с клавиатуры имя пользователя.
# Вывести на экран “Hello, [name]!”
a = input('Введите ваше имя: ')
print('Hello, ' + a + '!')