#Пользователь вводит значение температуры в градусах Цельсия.
a = float(input("Введите значение температуры в градусах Цельсия: "))
f = (a * 1.8) + 32
# Вывести температуру  в градусах Фаренгейта.
print("Вывожу температуру  в градусах Фаренгейта: ", f)

