# Выведите на экран n раз фразу "I am a programmer". Число n вводит пользователь.
a = int(input("Введите Ваше число: "))
for x in range(a):
    print("I am a programmer")
b = int(input("Введите Ваше число: "))
while a > 0:
    print("I am a programmer")
    a -= 1
