# Написать произвольную строку.
# Получить подстроку, которая начинается с пятого символа, заканчивается предпредпоследним символом с шагом три.
my_str = "1234567890"
print(my_str[4:-2:3])
