# Создать произвольную строку.
# Получить подстроку с нечетными элементами.
# Написать два решения с использованием полной и сокращенной записи.
my_str = "jdsfghdbhdbvfjdsbfjsdbvbdsnmbv"
print(my_str[1:len(my_str):2])
print(my_str[1::2])
