# Создать произвольную строку.
# Получить подстроку с начала и до седьмого элемента.
# Написать два решения с использованием полной и сокращенной записи.
my_str = "fsdjfdgfhgdjhgds"
print(my_str[0:6:1])
print(my_str[:6])
