# Создать произвольную строку.
# Получить подстроку с третьего элемента и до конца.
# Написать два решения с использованием полной и сокращенной записи.
my_str = "fsdjfdgfhgdjhgds"
print(my_str[2:len(my_str):1])
print(my_str[2:])
