#Дан список. Создать новый список, сдвинутый на 1 элемент влево
#Пример: 1 2 3 4 5 ->  2 3 4 5 1
a = [1, 2, 3, 4, 5]
i = 0
while i < len(a) / 2:
    t = a[i]
    a[i] = a[-i - 1]
    a[-i - 1] = t
    i = i + 1
print(a)